{"title":"Yes, Minister--A Classic Satire","date":"2020-04-03T14:48:50.000Z","date_formatted":{"ll":"Apr 3, 2020","L":"04/03/2020","MM-DD":"04-03"},"thumbnail":"https://img.cdn.n3ko.co/lsky/2020/04/03/944758f23364f.jpeg?x-oss-process=image/auto-orient,1/quality,q_70/sharpen,200/format,webp","link":"2020/04/03/Yes-Minister","comments":true,"tags":["Review"],"categories":["!Programming"],"updated":"2020-04-03T14:48:50.166Z","content":"<p>I got to know the English TV series <em>Yes, Minister</em> when I happened to see a set of screenshots of it. The humorous lines caught my attention at once. Produced in the 1980s, the comedy was over nearly 30 years old, but the politics still feels fresh.</p>\n<p><img src=\"https://img.cdn.n3ko.co/lsky/2020/04/03/a1e706b64e3ae.jpg?x-oss-process=image/auto-orient,1/quality,q_70/sharpen,200/format,webp\" class=\"φcy\" alt=\"cover\"></p>\n<p>The first three seasons is about John Hacker, the Minster of Administrative Affairs, his permanent secretary Humphrey Appleby, and private secretary Bernard Woolley. The sequel of the series is named <em>Yes, Prime Minister</em>. John Hacker becomes the Prime Minister, Humphrey the Cabinet Secretary, and Bernard still as Hacker’s private secretary. </p>\n<p><img src=\"https://img.cdn.n3ko.co/lsky/2020/04/03/673a4dd1823e1.jpg?x-oss-process=image/auto-orient,1/quality,q_70/sharpen,200/format,webp\" class=\"φcy\" alt=\"image\"></p>\n<p>The (Prime)Minister is held back by smart and wily Humphrey every times he tries to do something that “benefits” he government or the public, while Bernard cuts in the middle. The battle between the Minister and civil servant Humphrey, and the seemingly absurd theories that Humphrey deeply insists, are satires to the politicians and the government. Sometimes the audience can help but pity John the Minister as his ideals and principles become distorted and disappear completely due to the brutal pragmatism, or bureaucracy, placed on him not only by Humphrey and the Civil Service but also his own Cabinet colleague. The irreconcilable conflict between idealism and pragmatism wrapped in the coat of comedy may be reason why <em>Yes, Minister</em> and <em>Yes, Prime Minister</em> is so popular and thought-provoking since it is put on TV. </p>\n<p><img src=\"https://img.cdn.n3ko.co/lsky/2020/04/03/c24d49d1db657.png?x-oss-process=image/auto-orient,1/quality,q_70/sharpen,200/format,webp\" class=\"φcy\" alt=\"image\"></p>\n<p>Let alone the hilarious lines, the sharp wit, and the sarcasm of bureaucracy, I found myself learned quite a lot of terms in political occasions and British slangs, which may be a great help to improve my interpreting skills. One thing I found amusing is that the word “appalling”, seems to be the second popular word used in the series, the first being “minister”. </p>\n<p>In brief, <em>Yes, Minister</em> is a classic satire. Sometimes you may not get some of the joke, and yet it is also a good material to learn English. Frankly speaking, <em>Yes, Minister</em>, and another TV series, <em>Mind Your Language</em>,  are now my favorite English comedy. </p>\n","prev":{"title":"Fun Fact: Why add `1=1` in SQL Query Conditions?","link":"2020/04/17/Why-1-1"},"next":{"title":"Running Docker on WSL1","link":"2020/03/26/Running-Docker-on-WSL1"},"plink":"https://git.michaelsblog.top/2020/04/03/Yes-Minister/"}